app/controllers/comments_controller.rb

SELECT * FROM "posts" WHERE ("posts"."id" = 15)
INSERT INTO "comments" ("name", "referrer", "created_at", "body", "updated_at", "post_id", "approved", "website", "user_ip", "user_agent", "email") VALUES('Sam Soffes', 'http://localhost:3000/post/old-people-vs-the-other-side', '2009-08-03 19:14:25', 'Test comment!', '2009-08-03 19:14:25', 15, 't', 'http://samsoff.es', '127.0.0.1', 'Mozilla/5.0 (Macintosh; U; Intel Mac OS X 10_6; en-us) AppleWebKit/531.4 (KHTML, like Gecko) Version/4.0.3 Safari/531.4', 'sam@samsoff.es')
---
	def create
		@post = Post.find(params[:post_id])
		@comment = @post.comments.new(params[:comment])
		@comment.request = request

		if @comment.save