app/controllers/posts_controller.rb

SELECT * FROM "posts" WHERE (title like '%%' OR body like '%%') ORDER BY created_at DESC LIMIT 5 OFFSET 0
SELECT count(*) AS count_all FROM "posts" WHERE (title like '%%' OR body like '%%')
---
	def index
		@posts = Post.search(params[:search], params[:page])

SELECT * FROM "posts" WHERE ("posts"."slug" = 'testing') LIMIT 1
SELECT * FROM "posts" WHERE ("posts"."id" = 0)
---
	def show
	  if params[:slug]
	    @post = Post.find_by_slug(params[:slug])
	    raise ActiveRecord::RecordNotFound, 'Post not found' if @post.nil?
	  else
	    @post = Post.find(params[:id])

SELECT * FROM "posts" WHERE ("posts"."id" = 13)
---
	def edit
		@post = Post.find(params[:id])

INSERT INTO "posts" ("slug", "updated_at", "title", "body", "created_at") VALUES('cocoa-makes-it-easy', '2009-07-22 19:26:56', 'Cocoa Makes It Easy', 'So today I was wondering how to get the user''s time zone on the iPhone. So I googled it up. I found a [forum thread](http://www.iphonedevsdk.com/forum/iphone-sdk-development/13234-how-get-time-zone.html) that said look at `NSTimeZone`. Easy enough.
---
	def create
		@post = Post.new(params[:post])

		respond_to do |format|
			if @post.save

SELECT * FROM "posts" WHERE ("posts"."id" = 14)
UPDATE "posts" SET "body" = 'I spoke at the [Awesome Inc.](http://awesomeinc.org) Mobile miniConference in Lexington, KY over the weekend with [Jake Behrens](http://jakebehrens.com). About 100 people showed up for the event. I think its awesome that that many people have an interest in iPhone development in Lexington, KY. I did three sessions. My my two technical ones ("Scrolling Like Butter" and "Web Services with Cocoa") didn''t have too many attenders, but "How I Made an App that Has Over a Million Users" seemed to be a hit.
---
	def update
		@post = Post.find(params[:id])

		respond_to do |format|
			if @post.update_attributes(params[:post])